content/imported/tutorials/partitioned-pipe/fluid2-openfoam-pimplefoam/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        // Pressure Gradient is calculated by OpenFOAM to match inlet flux
        type            fixedFluxExtrapolatedPressure; 
        // type            fixedGradient;
        // gradient        uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
}
